using System;
using System.Collections.Generic;
using System.Security.Principal;
using System.Text;
using System.Xml.Linq;

namespace Restaurant.Models;
/// <summary>
/// الجدول الخاص بمحطات الطباعة في المطعم، يحتوي على معلومات عن كل محطة طباعة مثل اسمها والعلاقة بين المحطات والطابعات التصنيفات. يتيح هذا الجدول تنظيم الطابعات 
/// حسب المحطات المختلفة في المطعم وتحديد أي الفئات يجب أن تطبع على أي محطة طباعة بناءً على إعدادات النظام واحتياجات المطعم.
/// </summary>
public class PrintStation
{
    /// <summary>
    /// المعرف الخاص بمحطة الطباعة، يستخدم كمعرف فريد لكل محطة طباعة في النظام. يتم توليده تلقائيًا عند إنشاء محطة طباعة جديدة.
    /// </summary>
    public int Id { get; set; }

    /// <summary>
    /// اسم محطة الطباعة، يستخدم لتمييز كل محطة طباعة عن الأخرى في واجهة المستخدم.
    /// يجب أن يكون هذا الاسم فريدًا داخل النظام لتجنب الالتباس بين المحطات المختلفة. يتم عرض هذا الاسم للمستخدم عند اختيار محطة الطباعة لطباعة الطلبات المختلفة في المطعم.
    /// </summary>
    public string Name { get; set; }



    /// <summary>
    ///العلاقة بين محطات الطباعة والطابعات، حيث يمكن أن تحتوي محطة طباعة واحدة على عدة طابعات مرتبطة بها. هذا يسمح للنظام بتنظيم الطابعات
    ///حسب المحطات المختلفة في المطعم، مما يسهل إدارة الطابعات وتوجيه الأوامر للطباعة إلى الطابعة المناسبة بناءً على نوع الطلب الذي يتم طباعته.
    /// /// </summary>
    public ICollection<Printer> Printers { get; set; } = new List<Printer>();

    /// <summary>
    /// العلاقة بين محطات الطباعة التصنيفات، حيث يمكن أن تكون هناك فئات متعددة مرتبطة بمحطة طباعة واحدة، 
    /// والعكس صحيح. هذا يسمح للنظام بتحديد أي الفئات يجب أن تطبع على أي محطة طباعة بناءً على إعدادات النظام واحتياجات المطعم.
    /// </summary>
    public ICollection<CategoryPrintStation> CategoryPrintStations { get; set; } = new List<CategoryPrintStation>();  
}
